haskell/leap/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Exercism.io: Haskell</title>
<!-- 2015-05-10 Sun 19:55 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Eric Bailey" />
<meta  name="description" content="My solutions to Excercism.io in Haskell."
 />
</head>
<body>
<div id="content">
<h1 class="title">Exercism.io: Haskell</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Leap</h2>
<div class="outline-text-2" id="text-1">
<p>
Write a program that will take a year and report if it is a leap year.
</p>

<p>
The tricky thing here is that a leap year occurs:
</p>

<pre class="example">
on every year that is evenly divisible by 4
  except every year that is evenly divisible by 100
    unless the year is also evenly divisible by 400
</pre>

<p>
For example, 1997 is not a leap year, but 1996 is.  1900 is not a leap
year, but 2000 is.
</p>

<p>
If your language provides a method in the standard library that does
this look-up, pretend it doesn't exist and implement it yourself.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Notes</h3>
<div class="outline-text-3" id="text-1-1">
<p>
For a delightful, four minute explanation of the whole leap year
phenomenon, go watch <a href="http://www.youtube.com/watch?v=xX96xng7sAE">this youtube video</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Source</h3>
<div class="outline-text-3" id="text-1-2">
<p>
JavaRanch Cattle Drive, exercise 3 <a href="http://www.javaranch.com/leap.jsp">view source</a>
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Solution</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #F92672;">module</span> <span style="color: #66D9EF;">LeapYear</span> (isLeapYear) <span style="color: #F92672;">where</span>
</pre>
</div>

<p>
<code>isLeapYear</code> takes an <code>Integral</code> and returns a <code>Bool</code>, satisfying the equation:
</p>

<p>
$$\text{isLeapYear}(year) = \begin{cases}
True & 400\ \vert\ year \\
False & 100\ \vert\ year \\
True & 4\ \vert\ year \\
False & True \\
\end{cases}$$
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #A6E22E;">isLeapYear</span> <span style="color: #A6E22E;">::</span> <span style="color: #66D9EF;">Integral</span> a <span style="color: #FD971F;">=&gt;</span> a <span style="color: #FD971F;">-&gt;</span> <span style="color: #66D9EF;">Bool</span>
<span style="color: #A6E22E;">isLeapYear</span> year
  <span style="color: #FD971F;">|</span> 400 <span style="color: #FD971F;">`divides`</span> year <span style="color: #FD971F;">=</span> <span style="color: #66D9EF;">True</span>
  <span style="color: #FD971F;">|</span> 100 <span style="color: #FD971F;">`divides`</span> year <span style="color: #FD971F;">=</span> <span style="color: #66D9EF;">False</span>
  <span style="color: #FD971F;">|</span> 4   <span style="color: #FD971F;">`divides`</span> year <span style="color: #FD971F;">=</span> <span style="color: #66D9EF;">True</span>
  <span style="color: #FD971F;">|</span> otherwise          <span style="color: #FD971F;">=</span> <span style="color: #66D9EF;">False</span>
</pre>
</div>

<p>
<code>divides</code> is an infix function that takes two <code>Integral</code> numbers
and satisfies the equation:
</p>

<p>
$$d\ \text{divides}\ n = (n\ \text{rem}\ d \equiv 0)$$
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #A6E22E;">divides</span> <span style="color: #A6E22E;">::</span> <span style="color: #66D9EF;">Integral</span> a <span style="color: #FD971F;">=&gt;</span> a <span style="color: #FD971F;">-&gt;</span> a <span style="color: #FD971F;">-&gt;</span> <span style="color: #66D9EF;">Bool</span>
d `<span style="color: #A6E22E;">divides</span>` n <span style="color: #FD971F;">=</span> n <span style="color: #FD971F;">`rem`</span> d <span style="color: #FD971F;">==</span> 0
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Tests</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-sh">runhaskell leap_test.hs
</pre>
</div>
<pre class="example">
Cases: 4  Tried: 4  Errors: 0  Failures: 0
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
